import streamlit as st
import pandas as pd
import io
from edaUtils import get_basic_info, get_num_cat_describe, clean_duplicates, object_to_numeric_and_fillna,corr_graph, phik_corr, brand_plot, class_plot, pairplots
import warnings
warnings.filterwarnings('ignore')

st.set_page_config(page_title="EDA", page_icon="📊", layout="wide")
st.title("📊 EDA | Разведочный анализ тренировочного набора данных")
st.markdown("---")

@st.cache_data
def load_data():
    try:
        df = pd.read_csv('data/train_data.csv')
        return df
    except FileNotFoundError:
        st.error("Файл data/train_data.csv не найден!")
        return None


df = load_data()

if df is None:
    st.stop()

with st.sidebar:
    st.header("Настройки")
    sample_type = st.radio("Тип выборки:",["Первые n строк", "Последние n строк", "Случайные n строк"])
    sample_size = st.slider("Количество строк:", min_value=5, max_value=100, value=10)
    st.subheader("Визуализации")
    show_corr = st.checkbox("Корреляционные матрицы", value=True)
    if show_corr:
        corr_method = st.selectbox("Метод корреляции:",["pearson", "spearman", "phik"])
    show_brand_plot = st.checkbox("График марок автомобилей", value=True)
    show_class_plot = st.checkbox("График классов (ценовых категорий)", value=True)
    show_pairplot = st.checkbox("Попарные распределения", value=True)


st.metric("Всего строк", df.shape[0])
st.metric("Всего колонок", df.shape[1])
st.markdown("---")

st.header("1. Базовые характеристики")
basic_info = get_basic_info(df)
for i in basic_info:
    st.write(f"• {i}")

with st.expander("Типы данных и количество значений"):
    buffer = io.StringIO()
    df.info(buf=buffer)
    info_str = buffer.getvalue()
    st.code(info_str, language='text')


with st.expander("Статистическое описание данных"):
    num_describe, cat_describe = get_num_cat_describe(df)
    st.subheader("Числовые признаки")
    st.dataframe(num_describe, width='stretch')
    st.subheader("Категориальные признаки")
    st.dataframe(cat_describe, width='stretch')
    st.text("Имеется небольшой процент дубликатов (7%) и пропусков (1.1%) , что составляет очень малую долю от всех данных.В распределениях многих колонок виден перекос в сторону определённых значений (год машины - большинство в диапазоне от 2010 до 2020, цена - наоборот, сконцентрирована в левой части графика, топливо - большинство diesel и petrol, и т.д.). В целом, данные, хоть и не сбалансированы, хорошо отражают реальность рынка продажи машин. Дисбаланс в признаках настораживает с точки зрения возможного 'предубеждения' (bias с английского, но не в значении добавочной переменной, не могу лучше перевести) в будущей модели. А вот насколько это реально отразится на качестве модели узнаем только после проведения экспериментов :)")
st.markdown("---")

st.header("2. Очистка данных")

with st.spinner("Выполняется очистка данных..."):
    df_cleaned = df.copy()
    progress_bar = st.progress(0)
    progress_bar.progress(30)
    df_cleaned = clean_duplicates(df_cleaned)
    progress_bar.progress(70)
    df_cleaned = object_to_numeric_and_fillna(df_cleaned)
    progress_bar.progress(100)
    st.success(f"✅ Данные очищены! Осталось строк: {df_cleaned.shape[0]}")
    with st.expander("Статистическое описание данных"):
        num_describe, cat_describe = get_num_cat_describe(df_cleaned)
        st.subheader("Числовые признаки")
        st.dataframe(num_describe, width='stretch')
        st.subheader("Категориальные признаки")
        st.dataframe(cat_describe, width='stretch')
        st.text("Несущественный сдвиг в распределениях некоторых столбцов есть (едва ли влияющих на характер распределения), но он возник скорее из-за удаления дубликатов, чем заполнения пропусков. Так как заполняли медианой, 50% перцентилем, то из самого её определния следует, что сдвинуть распределение она не могла.")

st.markdown("---")

st.header("3. Пример очищенных данных")

if sample_type == "Первые n строк":
    sample_df = df_cleaned.head(sample_size)
    st.write(f"**Первые {sample_size} строк:**")
elif sample_type == "Последние n строк":
    sample_df = df_cleaned.tail(sample_size)
    st.write(f"**Последние {sample_size} строк:**")
else:
    sample_df = df_cleaned.sample(sample_size, random_state=42)
    st.write(f"**Случайные {sample_size} строк:**")

st.dataframe(sample_df, width='stretch')

csv = df_cleaned.to_csv(index=False).encode('utf-8')
st.download_button(label="Скачать очищенные данные (CSV)", data=csv, file_name='cleaned_car_data.csv', mime='text/csv')
st.markdown("---")

st.header("4. Визуализации")

if show_corr:
    st.subheader("Корреляционные матрицы")
    st.markdown("""
        **Pearson**: Линейная корреляция между непрерывными переменными  
        **Spearman**: Ранговая корреляция (монотонная зависимость)  
        **Phi-k**: Корреляция для смешанных типов данных (числовые и категориальные)
    """)

    if corr_method in ['pearson', 'spearman']:
        fig = corr_graph(df_cleaned, method=corr_method)
        if fig:
            st.pyplot(fig)
        else:
            st.error(f"Метод {corr_method} не поддерживается")
    elif corr_method == 'phik':
        with st.spinner('Корреляционная матрика phik генерируется...'):
            fig = phik_corr(df_cleaned)
        if fig:
            st.pyplot(fig)
            st.markdown(""" 
    Интерпретация результатов (**неактуальна тут, так как в изначальном ноутбуке вычислялось на необработанном столбце name, но здорово видеть более адекватные зависимости**):
    - довольно неожиданно выделена сильная связь имени и почти всех признаков, возможно, это связано с большой вариативностью в этой колонке, в результате чего результаты исказились
    - интересно, что здесь гораздо ниже оценена связь года выпуска и km_driven, возможно это связано с тем, что у них обратная линейная зависимость
    - зато можно выявить новые зависимости, в том числе и с категориальными переменными: max_torque_rpm и fuel, owner и selling_price (слабая, но есть)
    - в остальном, прослеживаются примерно те же связи, что и в таблице корреляций Пирсона и Спирмена
            """)
        else:
            st.error("Ошибка при вычислении Phi-k корреляции")

if show_brand_plot:
    st.subheader("Распределение цен по маркам")
    st.text("Видно малопредставленность некоторых марок машин (все после ниссана). Заметны выбросы + некоторая зависимость цены от бренда (как минимум, виден диапазон цен для разных марок).")
    fig = brand_plot(df_cleaned)
    st.pyplot(fig)

if show_class_plot:
    st.subheader("Распределение по классам (ценовым категориям)")
    st.markdown("""
    Выделим четыре группы:
    - бюджетные авто (медиана < 200 000)
    - низший эконом класс (200 000 < медиана < 500 000)
    - верхний эконом класс (500 000 < медиана < 1000 000)
    - бизнес класс (1000 000 < медиана)
    
    Эконом класс разделился на 2, так как он составляет довольно широкую прослойку и люди внутри среднего класса, составляющие целевую аудиторию таких машин, тоже сильно отличаются - не зря выделяют верхний и низший средний класс.
    """)
    fig = class_plot(df_cleaned)
    st.pyplot(fig)
    st.text("Видно явный перекос в сторону низшего эконом класса, откуда следует, что и цены из диапазона 200 000 - 500 000 наиболее представлены. Это может сильно повлиять на работу модели. Похожие результаты можно было бы получить классическим boxplot'ом, но так получается нагляднее и позволяет оценить стоимость в разрезе марок машин, принадлежащих разным ценовым категориям.")

if show_pairplot:
    st.subheader("Попарное распределение признаков")
    with st.spinner("Pairplot генерируется..."):
        try:
            fig = pairplots(df_cleaned)
            st.pyplot(fig)
            st.markdown("""
                Некоторые прослеживаемые зависимости:
                1. Связь цены и года выпуска автомобиля, max_power, torque (слабее чем другие два)
                2. Связь year и km_driven (что вполне логично), max_power и torque
                """)
        except Exception as e:
            st.error(f"Ошибка при создании pairplot: {e}")



